{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "BertForSequenceClassification",
    "parent_library": "transformers.models.bert.modeling_bert"
  },
  "base_model_name_or_path": "bert-base-uncased",
  "bias": "lora_only",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 64,
  "lora_dropout": 0.01,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "bert.encoder.layer.2.attention.self.query",
    "bert.encoder.layer.15.attention.self.value",
    "bert.encoder.layer.11.attention.self.query",
    "bert.encoder.layer.13.attention.self.query",
    "bert.encoder.layer.1.attention.self.query",
    "bert.encoder.layer.8.attention.self.query",
    "bert.encoder.layer.15.attention.self.query",
    "bert.encoder.layer.8.attention.self.value",
    "bert.encoder.layer.14.attention.self.value",
    "bert.encoder.layer.12.attention.self.query",
    "bert.encoder.layer.0.attention.self.value",
    "bert.encoder.layer.9.attention.self.query",
    "bert.encoder.layer.4.attention.self.query",
    "bert.encoder.layer.13.attention.self.value",
    "bert.encoder.layer.5.attention.self.query",
    "bert.encoder.layer.1.attention.self.value",
    "bert.encoder.layer.9.attention.self.value",
    "bert.encoder.layer.7.attention.self.value",
    "bert.encoder.layer.14.attention.self.query",
    "bert.encoder.layer.3.attention.self.query",
    "bert.encoder.layer.12.attention.self.value",
    "bert.encoder.layer.11.attention.self.value",
    "bert.encoder.layer.5.attention.self.value",
    "bert.encoder.layer.6.attention.self.value",
    "bert.encoder.layer.7.attention.self.query",
    "bert.encoder.layer.10.attention.self.query",
    "bert.encoder.layer.4.attention.self.value",
    "bert.encoder.layer.3.attention.self.value",
    "bert.encoder.layer.2.attention.self.value",
    "bert.encoder.layer.10.attention.self.value",
    "bert.encoder.layer.0.attention.self.query",
    "bert.encoder.layer.6.attention.self.query"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}